Autodesk.Revit.DB.ParameterSelectionResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ParameterSelectionResult.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ForgeSchemaClosure})
Indicates that the given schemas were selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ParameterSelectionResult.#ctor
Indicates that selection was unsuccessful or canceled.

Autodesk.Revit.DB.ParameterSelectionResult
Indicates the result of a parameter selection.